# Задайте список из вещественных чисел.
# Напишите программу, которая найдёт разницу между максимальным
# и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

lis = [1.1, 1.2, 3.1, 5, 10.01]
lis2 = []

for i in range(len(lis)):
    if lis[i] % 1 != 0:
        lis2.append(round(lis[i] % 1, 2))
        i += 1
print(max(lis2) - min(lis2))